;merge dbo.Settings as target
using
(
	values
	(1, 'ActivePetitionVoteCount', '7', N'Кількість голосів за петицію, яка необхідна для того, щоб петиція вважалась активною.')
) as source (ID, [Key], [Value], [Description])
on target.ID = source.ID

when matched then
	update
	set
		[Key] = source.[Key],
		[Value] = source.[Value],
		[Description] = source.[Description]

when not matched by target then
	insert (ID, [Key], [Value], [Description])
	values (ID, [Key], [Value], [Description])
	
when not matched by source then
	delete;

go



-- dbo.EntityGroup
set identity_insert dbo.EntityGroup on
go

;merge dbo.EntityGroup as target
using
(
	values
	(1,		NULL,		'Agreement'),
	(2,		1,			'Status'),
	(3,		NULL,		'Certificate'),
	(4,		3,			'Type'),
	(5,		NULL,		'Petition'),
	(6,		5,			'Category'),
	(8,		NULL,		'Candidate'),
	(9,		8,			'Status'),
	(10,	8,			'Type')
) as source (ID, ParentID, Name)
on target.ID = source.ID

when matched then
	update
	set
		ParentID = source.ParentID,
		Name = source.Name

when not matched by target then
	insert (ID, ParentID, Name)
	values (ID, ParentID, Name)
	
when not matched by source then
	delete;
go

set identity_insert dbo.EntityGroup off
go


-- dbo.Entity
set identity_insert dbo.Entity on
go

;merge dbo.Entity as target
using
(
	values
	(1,		2,		'P_Agreement_Status_Active',					N'Активний'),
	(2,		2,		'P_Agreement_Status_Inactive',					N'Неактивний'),
	(3,		4,		'P_Certificate_Type_UACrypto',					N'UACrypto'),
	(4,		4,		'P_Certificate_Type_DPA',						N'DPA'),
	(5,		6,		'P_Petition_Category_HealthCare',				N'Охорона здоров''я'),
	(6,		6,		'P_Petition_Category_Military',					N'Військова сфера'),
	(7,		6,		'P_Petition_Category_City',						N'Місто'),
	(8,		6,		'P_Petition_Category_Economic',					N'Економіка'),
	(9,		6,		'P_Petition_Category_OutherPolitic',			N'Політика (інше)'),
	(10,	6,		'P_Petition_Category_Culture',					N'Культура'),
	(11,	6,		'P_Petition_Category_Education',				N'Освіта'),
	(12,	6,		'P_Petition_Category_PeopleRulesViolation',		N'Порушення прав людини'),
	(13,	6,		'P_Petition_Category_Housing',					N'Домогосподарство'),
	(14,	6,		'P_Petition_Category_Transport',				N'Транспорт'),
	(15,	6,		'P_Petition_Category_Ecology',					N'Екологія'),
	(16,	6,		'P_Petition_Category_ArrangeState',				N'Регіони'),
	(17,	6,		'P_Petition_Category_Etc',						N'Інше'),
	(18,	9,		'P_Candidate_Status_Active',					N'Активний'),
	(19,	9,		'P_Candidate_Status_Inactive',					N'Неактивний'),
	(20,	10,		'P_Candidate_Type_Independent',					N'Самовисуванець'),
	(21,	10,		'P_Candidate_Type_PartyMember',					N'Партія')

) as source (ID, EntityGroupID, Name, [Description])
on target.ID = source.ID

when matched then
	update
	set
		EntityGroupID = source.EntityGroupID,
		Name = source.Name,
		[Description] = source.[Description]

when not matched by target then
	insert (ID, EntityGroupID, Name, [Description])
	values (ID, EntityGroupID, Name, [Description])
	
when not matched by source then
	delete;
go

set identity_insert dbo.Entity off
go




-- dbo.PetitionLevel
set identity_insert dbo.PetitionLevel on
go

;merge dbo.PetitionLevel as target
using
(
	values
	(1,	N'Національний',	150),
	(2,	N'Обласний',		150),
	(3,	N'Міський',		150)
) as source (ID, Name, Limit)
on target.ID = source.ID

when matched then
	update
	set
		Name = source.Name,
		Limit = source.Limit

when not matched by target then
	insert (ID, Name, Limit)
	values (ID, Name, Limit)
	
when not matched by source then
	delete;
go

set identity_insert dbo.PetitionLevel off
go



-- dbo.Region
set identity_insert dbo.Region on
go

;merge dbo.Region as target
using
(
	values
	(1,	N'Україна',	1),
	(2,	N'Київ',	3),
	(3,	N'Харків',	3),
	(4,	N'Одеса',	3),
	(5,	N'Львів',	3),
	(6,	N'АР Крим',	3)
) as source (ID, Name, LevelID)
on target.ID = source.ID

when matched then
	update
	set
		Name = source.Name,
		LevelID = source.LevelID

when not matched by target then
	insert (ID, Name, LevelID)
	values (ID, Name, LevelID)
	
when not matched by source then
	delete;
go

set identity_insert dbo.Region off
go



-- dbo.Organization
set identity_insert dbo.Organization on
go

;merge dbo.Organization as target
using
(
	values
	(
		1,
		N'Верховна Рада України',
		N'Єдиний орган законодавчої влади в Україні',
		N'До повноважень Верховної Ради України належить:' + char(10) +
			N'1) внесення змін до Конституції України в межах і порядку, передбачених розділом XIII цієї Конституції;' + char(10) +
			N'2) призначення всеукраїнського референдуму з питань, визначених статтею 73 цієї Конституції;' + char(10) +
			N'3) прийняття законів;' + char(10) +
			N'4) затвердження Державного бюджету України та внесення змін до нього, контроль за виконанням Державного бюджету України, прийняття рішення щодо звіту про його виконання;' + char(10) +
			N'5) визначення засад внутрішньої і зовнішньої політики;' + char(10) +
			N'6) затвердження загальнодержавних програм економічного, науково-технічного, соціального, національно-культурного розвитку, охорони довкілля;' + char(10) +
			N'7) призначення виборів Президента України у строки, передбачені цією Конституцією;' + char(10) +
			N'8) заслуховування щорічних та позачергових послань Президента України про внутрішнє і зовнішнє становище України;' + char(10) +
			N'9) оголошення за поданням Президента України стану війни і укладення миру, схвалення рішення Президента України про використання Збройних Сил України та інших військових формувань у разі збройної агресії проти України;' + char(10) +
			N'10) усунення Президента України з поста в порядку особливої процедури (імпічменту), встановленому статтею 111 цієї Конституції;' + char(10) +
			N'11) розгляд і прийняття рішення щодо схвалення Програми діяльності Кабінету Міністрів України;' + char(10) +
			N'12) призначення за поданням Президента України Прем’єр-міністра України, Міністра оборони України, Міністра закордонних справ України, призначення за поданням Прем’єр-міністра України інших членів Кабінету Міністрів України, Голови Антимонопольного комітету України, Голови Державного комітету телебачення і радіомовлення України, Голови Фонду державного майна України, звільнення зазначених осіб з посад, вирішення питання про відставку Прем’єр-міністра України, членів Кабінету Міністрів України;' + char(10) +
			N'12-1) призначення на посаду та звільнення з посади за поданням Президента України Голови Служби безпеки України;' + char(10) +
			N'13) здійснення контролю за діяльністю Кабінету Міністрів України відповідно до цієї Конституції та закону;' + char(10) +
			N'14) затвердження рішень про надання Україною позик і економічної допомоги іноземним державам та міжнародним організаціям, а також про одержання Україною від іноземних держав, банків і міжнародних фінансових організацій позик, не передбачених Державним бюджетом України, здійснення контролю за їх використанням;' + char(10) +
			N'15) прийняття Регламенту Верховної Ради України;' + char(10) +
			N'16) призначення на посади та звільнення з посад Голови та інших членів Рахункової палати;' + char(10) +
			N'17) призначення на посаду та звільнення з посади Уповноваженого Верховної Ради України з прав людини; заслуховування його щорічних доповідей про стан дотримання та захисту прав і свобод людини в Україні;' + char(10) +
			N'18) призначення на посаду та звільнення з посади Голови Національного банку України за поданням Президента України;' + char(10) +
			N'19) призначення на посади та звільнення з посад половини складу Ради Національного банку України;' + char(10) +
			N'20) призначення на посади та звільнення з посад половини складу Національної ради України з питань телебачення і радіомовлення;' + char(10) +
			N'21) призначення на посади та звільнення з посад членів Центральної виборчої комісії за поданням Президента України;' + char(10) +
			N'22) затвердження загальної структури, чисельності, визначення функцій Служби безпеки України, Збройних Сил України, інших утворених відповідно до законів України військових формувань, а також Міністерства внутрішніх справ України;' + char(10) +
			N'23) схвалення рішення про надання військової допомоги іншим державам, про направлення підрозділів Збройних Сил України до іншої держави чи про допуск підрозділів збройних сил інших держав на територію України;' + char(10) +
			N'24) встановлення державних символів України;' + char(10) +
			N'25) надання згоди на призначення на посаду та звільнення з посади Президентом України Генерального прокурора України; висловлення недовіри Генеральному прокуророві України, що має наслідком його відставку з посади;' + char(10) +
			N'26) призначення на посади та звільнення з посад третини складу Конституційного Суду України;' + char(10) +
			N'27) обрання суддів безстроково;' + char(10) +
			N'28) дострокове припинення повноважень Верховної Ради Автономної Республіки Крим за наявності висновку Конституційного Суду України про порушення нею Конституції України або законів України; призначення позачергових виборів до Верховної Ради Автономної Республіки Крим;' + char(10) +
			N'29) утворення і ліквідація районів, встановлення і зміна меж районів і міст, віднесення населених пунктів до категорії міст, найменування і перейменування населених пунктів і районів;' + char(10) +
			N'30) призначення чергових та позачергових виборів до органів місцевого самоврядування;' + char(10) +
			N'31) затвердження протягом двох днів з моменту звернення Президента України указів про введення воєнного чи надзвичайного стану в Україні або в окремих її місцевостях, про загальну або часткову мобілізацію, про оголошення окремих місцевостей зонами надзвичайної екологічної ситуації;' + char(10) +
			N'32) надання законом згоди на обов’язковість міжнародних договорів України та денонсація міжнародних договорів України;' + char(10) +
			N'33) здійснення парламентського контролю у межах, визначених цією Конституцією та законом;' + char(10) +
			N'34) прийняття рішення про направлення запиту до Президента України на вимогу народного депутата України, групи народних депутатів України чи комітету Верховної Ради України, попередньо підтриману не менш як однією третиною від конституційного складу Верховної Ради України;' + char(10) +
			N'35) призначення на посаду та звільнення з посади керівника апарату Верховної Ради України; затвердження кошторису Верховної Ради України та структури її апарату;' + char(10) +
			N'36) затвердження переліку об’єктів права державної власності, що не підлягають приватизації, визначення правових засад вилучення об’єктів права приватної власності;' + char(10) +
			N'37) затвердження законом Конституції Автономної Республіки Крим, змін до неї.' + char(10) + char(10) +
			N'Верховна Рада України здійснює також інші повноваження, які відповідно до Конституції України віднесені до її відання. Конституція України, Стаття 85.',
	
		'/wp-content/uploads/verkhovna_rada.jpg',
		N'Основними завданнями Відділу є:' + char(10) +
			N'забезпечення відповідно до Конституції України і Закону України “Про звернення громадян” можливості громадянам без обмежень звертатись поштою або особисто до Верховної Ради України з питань, які належать до її компетенції;' + char(10) +
			N'розгляд одержаних поштою пропозицій, заяв і скарг громадян, які звертаються до Верховної Ради України;' + char(10) +
			N'організація особистого прийому громадян головами комітетів Верховної Ради України, головами депутатських фракцій у Верховній Раді України у сесійний період у приймальні Верховної Ради України;' + char(10) +
			N'здійснення особистого прийому громадян у приймальні Верховної Ради України;' + char(10) +
			N'реєстрація пропозицій, заяв і скарг громадян, які надходять до структурних підрозділів Апарату Верховної Ради України, у тому числі секретаріатів комітетів Верховної Ради України та секретаріатів депутатських фракцій у Верховній Раді України;' + char(10) +
			N'організація систематичного обліку пропозицій, заяв і скарг громадян, які надходять до Верховної Ради України;' + char(10) +
			N'вивчення та узагальнення питань, що порушуються у зверненнях громадян до Верховної Ради України, підготовка відповідних аналітичних матеріалів і інформування керівництва Верховної Ради України та Апарату Верховної Ради України;' + char(10) +
			N'сприяння народним депутатам України в роботі із зверненнями громадян;' + char(10) +
			N'надання організаційно-методичної допомоги в роботі із зверненнями громадян структурним підрозділам Апарату Верховної Ради України, у тому числі секретаріатам комітетів Верховної Ради України та секретаріатам депутатських фракцій у Верховній Раді України, органам місцевого самоврядування;' + char(10) +
			N'організація висвітлення матеріалів про особистий прийом та розгляд звернень громадян у Верховній Раді України.',
		150,
		5,
		25000,
		90,
		'2014-12-21 13:31:25.0000000',
		N'Unknown app user',
		NULL,
		NULL
	),
	(
		2,
		N'Президент України',
		N'Основні повноваження Президента України закріплені у статті 106 Конституції України. Глава держави здійснює також інші повноваження, визначені Конституцією України.',
		N'Президент України:' + char(10) +
			N'1) забезпечує державну незалежність, національну безпеку і правонаступництво держави;' + char(10) +
			N'2) звертається з посланнями до народу та із щорічними і позачерговими посланнями до Верховної Ради України про внутрішнє і зовнішнє становище України;' + char(10) +
			N'3) представляє державу в міжнародних відносинах, здійснює керівництво зовнішньополітичною діяльністю держави, веде переговори та укладає міжнародні договори України;' + char(10) +
			N'4) приймає рішення про визнання іноземних держав;' + char(10) +
			N'5) призначає та звільняє глав дипломатичних представництв України в інших державах і при міжнародних організаціях; приймає вірчі і відкличні грамоти дипломатичних представників іноземних держав;',
		'/wp-content/uploads/prezydent.jpg',
		N'Президент України:' + char(10) + + char(10) +
			N'1) забезпечує державну незалежність, національну безпеку і правонаступництво держави;' + char(10) +
			N'2) звертається з посланнями до народу та із щорічними і позачерговими посланнями до Верховної Ради України про внутрішнє і зовнішнє становище України;' + char(10) +
			N'3) представляє державу в міжнародних відносинах, здійснює керівництво зовнішньополітичною діяльністю держави, веде переговори та укладає міжнародні договори України;' + char(10) +
			N'4) приймає рішення про визнання іноземних держав;' + char(10) +
			N'5) призначає та звільняє глав дипломатичних представництв України в інших державах і при міжнародних організаціях; приймає вірчі і відкличні грамоти дипломатичних представників іноземних держав;' + char(10),
		150,
		5,
		25000,
		90,
		'2014-12-21 13:31:35.0000000',
		N'Unknown app user',
		NULL,
		NULL
	),
	(
		3,
		N'Київська міська державна адміністрація',
		N'Місцевий орган державної виконавчої влади в м. Києві',
		N'У межах своїх повноважень здійснює виконавчу владу на території відповідної адміністративно-територіальної одиниці країни (область, район, міста Київ), а також реалізує повноваження, делеговані їй відповідною радою. Місцеві державні адміністрації є юридичними особами, знаходяться відповідно в обласних і районних центрах, містах Києві та Севастополі.' + char (10) +
			N'На будинках, де розміщуються місцеві державні адміністрації, піднімається Державний Прапор України.',
		'/wp-content/uploads/kyiv_gerb.jpg',
		N'Додаткових вимог щодо збору голосоів за петиції не висуното. Таким чином, усі вимоги зводяться до загальних вимог, зазначених за адресою https://enarod.org/faq.',
		150,
		5,
		25000,
		90,
		'2014-12-28 20:50:04.0000000',
		N'Unknown user',
		NULL,
		NULL
	),
	(
		4,
		N'Кабінет Міністрів України',
		NULL,
		NULL,
		'/wp-content/uploads/cab_min.jpg',
		NULL,
		150,
		5,
		25000,
		90,
		'2014-12-28 20:58:30.0000000',
		N'Unknown user',
		NULL,
		NULL
	)
) as source
(
	ID
    ,Name
    ,[Description]
    ,PrivateDescription
    ,Logo
    ,AcceptancePolicy
    ,PreliminaryVoteCount
    ,PreliminaryGatheringDays
    ,VoteCount
    ,GatheringDays
    ,CreatedDate
    ,CreatedBy
    ,ModifiedDate
    ,ModifiedBy
)
on target.ID = source.ID

when matched then
	update
	set
		Name							= source.Name,
		[Description]					= source.[Description],
		PrivateDescription				= source.PrivateDescription,
		Logo							= source.Logo,
		AcceptancePolicy				= source.AcceptancePolicy,
		PreliminaryVoteCount			= source.PreliminaryVoteCount,
		PreliminaryGatheringDays		= source.PreliminaryGatheringDays,
		VoteCount						= source.VoteCount,
		GatheringDays					= source.GatheringDays,
		CreatedDate						= source.CreatedDate,
		CreatedBy						= source.CreatedBy,
		ModifiedDate					= source.ModifiedDate,
		ModifiedBy						= source.ModifiedBy

when not matched by target then
	insert
	(
		 ID
		,Name
		,[Description]
		,PrivateDescription
		,Logo
		,AcceptancePolicy
		,PreliminaryVoteCount
		,PreliminaryGatheringDays
		,VoteCount
		,GatheringDays
		,CreatedDate
		,CreatedBy
		,ModifiedDate
		,ModifiedBy
	)
	values
	(
		 ID
		,Name
		,[Description]
		,PrivateDescription
		,Logo
		,AcceptancePolicy
		,PreliminaryVoteCount
		,PreliminaryGatheringDays
		,VoteCount
		,GatheringDays
		,CreatedDate
		,CreatedBy
		,ModifiedDate
		,ModifiedBy
	)
	
when not matched by source then
	delete;
go

set identity_insert dbo.Organization off
go



-- dbo.PetitionStatus
;merge dbo.PetitionStatus as target
using
(
	values
	(1, N'Модерація'),
	(2, N'Збір підписів'),
	(3, N'На розгляді'),
	(4, N'З відповіддю'),
	(5, N'Відмовлено')
) as source (ID, Name)
on target.ID = source.ID

when matched then
	update
	set
		Name = source.Name

when not matched by target then
	insert (ID, Name)
	values (ID, Name)

when not matched by source then
	delete;



-- auth.App_Role
set identity_insert auth.App_Role on
go

;merge auth.App_Role as target
using
(
	values
	(1,		'Admin'),
	(2,		'Moderator'),
	(3,		'TeamMember'),
	(4,		'User')
) as source (ID, Name)
on target.ID = source.ID

when matched then
	update
	set
		Name = source.Name

when not matched by target then
	insert (ID, Name)
	values (ID, Name)
	
when not matched by source then
	delete;
go

set identity_insert auth.App_Role off
go